srmlite/templates/srmPing_req.g2

@@
<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:srmPing soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://srm.lbl.gov/StorageResourceManager">
      <srmPingRequest xsi:type="ns1:srmPingRequest">
        <authorizationID xsi:type="xsd:string" xsi:nil="true"/>
      </srmPingRequest>
    </ns1:srmPing>
  </soapenv:Body>
</soapenv:Envelope>
@@